doe/results_full_30deg/cases/case_03/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

combustionModel none;
